[
  {
    "Conditions": {
      "Applications": {
        "ApplicationFilter": {
          "Mode": null,
          "Rule": null
        },
        "ExcludeApplications": [],
        "IncludeApplications": [
          "All"
        ],
        "IncludeAuthenticationContextClassReferences": [],
        "IncludeUserActions": []
      },
      "AuthenticationFlows": {
        "TransferMethods": null
      },
      "ClientAppTypes": [
        "exchangeActiveSync",
        "other"
      ],
      "ClientApplications": {
        "ExcludeServicePrincipals": null,
        "IncludeServicePrincipals": null,
        "ServicePrincipalFilter": {
          "Mode": null,
          "Rule": null
        }
      },
      "Devices": {
        "DeviceFilter": {
          "Mode": null,
          "Rule": null
        }
      },
      "InsiderRiskLevels": null,
      "Locations": {
        "ExcludeLocations": null,
        "IncludeLocations": null
      },
      "Platforms": {
        "ExcludePlatforms": null,
        "IncludePlatforms": null
      },
      "ServicePrincipalRiskLevels": [],
      "SignInRiskLevels": [],
      "UserRiskLevels": [],
      "Users": {
        "ExcludeGroups": [],
        "ExcludeGuestsOrExternalUsers": {
          "ExternalTenants": {
            "MembershipKind": null
          },
          "GuestOrExternalUserTypes": null
        },
        "ExcludeRoles": [],
        "ExcludeUsers": [],
        "IncludeGroups": [],
        "IncludeGuestsOrExternalUsers": {
          "ExternalTenants": {
            "MembershipKind": null
          },
          "GuestOrExternalUserTypes": null
        },
        "IncludeRoles": [],
        "IncludeUsers": [
          "All"
        ]
      }
    },
    "CreatedDateTime": "2025-11-24T14:13:47.8435221Z",
    "Description": null,
    "DisplayName": "CA – Block Legacy Authentication",
    "GrantControls": {
      "AuthenticationStrength": {
        "AllowedCombinations": null,
        "CombinationConfigurations": null,
        "CreatedDateTime": null,
        "Description": null,
        "DisplayName": null,
        "Id": null,
        "ModifiedDateTime": null,
        "PolicyType": null,
        "RequirementsSatisfied": null
      },
      "BuiltInControls": [
        "block"
      ],
      "CustomAuthenticationFactors": [],
      "Operator": "OR",
      "TermsOfUse": []
    },
    "Id": "e094a067-661f-48f9-9225-acd4fa5dcf06",
    "ModifiedDateTime": null,
    "SessionControls": {
      "ApplicationEnforcedRestrictions": {
        "IsEnabled": null
      },
      "CloudAppSecurity": {
        "CloudAppSecurityType": null,
        "IsEnabled": null
      },
      "DisableResilienceDefaults": null,
      "PersistentBrowser": {
        "IsEnabled": null,
        "Mode": null
      },
      "SecureSignInSession": {
        "IsEnabled": null
      },
      "SignInFrequency": {
        "AuthenticationType": null,
        "FrequencyInterval": null,
        "IsEnabled": null,
        "Type": null,
        "Value": null
      }
    },
    "State": "enabled",
    "TemplateId": null,
    "AdditionalProperties": {}
  },
  {
    "Conditions": {
      "Applications": {
        "ApplicationFilter": {
          "Mode": null,
          "Rule": null
        },
        "ExcludeApplications": [],
        "IncludeApplications": [
          "All"
        ],
        "IncludeAuthenticationContextClassReferences": [],
        "IncludeUserActions": []
      },
      "AuthenticationFlows": {
        "TransferMethods": null
      },
      "ClientAppTypes": [
        "all"
      ],
      "ClientApplications": {
        "ExcludeServicePrincipals": null,
        "IncludeServicePrincipals": null,
        "ServicePrincipalFilter": {
          "Mode": null,
          "Rule": null
        }
      },
      "Devices": {
        "DeviceFilter": {
          "Mode": null,
          "Rule": null
        }
      },
      "InsiderRiskLevels": null,
      "Locations": {
        "ExcludeLocations": null,
        "IncludeLocations": null
      },
      "Platforms": {
        "ExcludePlatforms": null,
        "IncludePlatforms": null
      },
      "ServicePrincipalRiskLevels": [],
      "SignInRiskLevels": [],
      "UserRiskLevels": [],
      "Users": {
        "ExcludeGroups": [],
        "ExcludeGuestsOrExternalUsers": {
          "ExternalTenants": {
            "MembershipKind": null
          },
          "GuestOrExternalUserTypes": null
        },
        "ExcludeRoles": [],
        "ExcludeUsers": [
          "84d62495-84dc-41d7-ace7-ab28f886dcb3"
        ],
        "IncludeGroups": [],
        "IncludeGuestsOrExternalUsers": {
          "ExternalTenants": {
            "MembershipKind": null
          },
          "GuestOrExternalUserTypes": null
        },
        "IncludeRoles": [],
        "IncludeUsers": [
          "All"
        ]
      }
    },
    "CreatedDateTime": "2025-11-24T14:23:23.4979661Z",
    "Description": null,
    "DisplayName": "CA – Require MFA",
    "GrantControls": {
      "AuthenticationStrength": {
        "AllowedCombinations": null,
        "CombinationConfigurations": null,
        "CreatedDateTime": null,
        "Description": null,
        "DisplayName": null,
        "Id": null,
        "ModifiedDateTime": null,
        "PolicyType": null,
        "RequirementsSatisfied": null
      },
      "BuiltInControls": [
        "mfa"
      ],
      "CustomAuthenticationFactors": [],
      "Operator": "OR",
      "TermsOfUse": []
    },
    "Id": "e501c6a6-7726-4790-815d-b8cd81c3d4f2",
    "ModifiedDateTime": "2025-12-14T16:07:53.2660727Z",
    "SessionControls": {
      "ApplicationEnforcedRestrictions": {
        "IsEnabled": null
      },
      "CloudAppSecurity": {
        "CloudAppSecurityType": null,
        "IsEnabled": null
      },
      "DisableResilienceDefaults": null,
      "PersistentBrowser": {
        "IsEnabled": null,
        "Mode": null
      },
      "SecureSignInSession": {
        "IsEnabled": null
      },
      "SignInFrequency": {
        "AuthenticationType": null,
        "FrequencyInterval": null,
        "IsEnabled": null,
        "Type": null,
        "Value": null
      }
    },
    "State": "enabled",
    "TemplateId": null,
    "AdditionalProperties": {}
  },
  {
    "Conditions": {
      "Applications": {
        "ApplicationFilter": {
          "Mode": null,
          "Rule": null
        },
        "ExcludeApplications": [],
        "IncludeApplications": [
          "All"
        ],
        "IncludeAuthenticationContextClassReferences": [],
        "IncludeUserActions": []
      },
      "AuthenticationFlows": {
        "TransferMethods": null
      },
      "ClientAppTypes": [
        "all"
      ],
      "ClientApplications": {
        "ExcludeServicePrincipals": null,
        "IncludeServicePrincipals": null,
        "ServicePrincipalFilter": {
          "Mode": null,
          "Rule": null
        }
      },
      "Devices": {
        "DeviceFilter": {
          "Mode": null,
          "Rule": null
        }
      },
      "InsiderRiskLevels": null,
      "Locations": {
        "ExcludeLocations": null,
        "IncludeLocations": null
      },
      "Platforms": {
        "ExcludePlatforms": null,
        "IncludePlatforms": null
      },
      "ServicePrincipalRiskLevels": [],
      "SignInRiskLevels": [],
      "UserRiskLevels": [],
      "Users": {
        "ExcludeGroups": [],
        "ExcludeGuestsOrExternalUsers": {
          "ExternalTenants": {
            "MembershipKind": null
          },
          "GuestOrExternalUserTypes": null
        },
        "ExcludeRoles": [],
        "ExcludeUsers": [],
        "IncludeGroups": [],
        "IncludeGuestsOrExternalUsers": {
          "ExternalTenants": {
            "MembershipKind": null
          },
          "GuestOrExternalUserTypes": null
        },
        "IncludeRoles": [],
        "IncludeUsers": [
          "All"
        ]
      }
    },
    "CreatedDateTime": "2025-11-24T14:26:02.3327619Z",
    "Description": null,
    "DisplayName": "CA – Require compliant device",
    "GrantControls": {
      "AuthenticationStrength": {
        "AllowedCombinations": null,
        "CombinationConfigurations": null,
        "CreatedDateTime": null,
        "Description": null,
        "DisplayName": null,
        "Id": null,
        "ModifiedDateTime": null,
        "PolicyType": null,
        "RequirementsSatisfied": null
      },
      "BuiltInControls": [
        "compliantDevice"
      ],
      "CustomAuthenticationFactors": [],
      "Operator": "OR",
      "TermsOfUse": []
    },
    "Id": "859514a7-edd4-4dbb-915c-a03c963c69b6",
    "ModifiedDateTime": "2025-11-24T14:34:49.1031069Z",
    "SessionControls": {
      "ApplicationEnforcedRestrictions": {
        "IsEnabled": null
      },
      "CloudAppSecurity": {
        "CloudAppSecurityType": null,
        "IsEnabled": null
      },
      "DisableResilienceDefaults": null,
      "PersistentBrowser": {
        "IsEnabled": null,
        "Mode": null
      },
      "SecureSignInSession": {
        "IsEnabled": null
      },
      "SignInFrequency": {
        "AuthenticationType": null,
        "FrequencyInterval": null,
        "IsEnabled": null,
        "Type": null,
        "Value": null
      }
    },
    "State": "disabled",
    "TemplateId": null,
    "AdditionalProperties": {}
  }
]
